In [6]:
import sqlite3 as sql3

In [7]:
#Connect to a database named Machine Learning
conn=sql3.connect('Machine_Learning')
print ("Opened Databse Successfully")

Opened Databse Successfully

In [8]:
cur=conn.cursor()

In [10]:
#drop these 2 tables if they exist
#cur.execute ("DROP TABLE Students")
#cur.execute ("DROP TABLE Courses")
print("Tables dropped successfully")

Tables dropped successfully

In [11]:
#create a table named coursename
cur.execute ('''CREATE TABLE Students (ID int, Fname text, Lname text, Country text, City text, Continent text, Course text)''')
print("Table created successfully")

Table created successfully

In [12]:
#create a table named coursename
cur.execute ('''CREATE TABLE Courses (ID int, Coursename text)''')
print("Table created successfully")

Table created successfully

In [13]:
#insert multiple records into the table Studenst

Student_List=[
    (1, 'Nicholas', 'Okello', 'Kenya', 'Nairobi', 'Africa', 'Advanced Python'),
    (2, 'Tim', 'Kabugi', 'Kenya', 'Nairobi', 'Africa', 'Advanced Python'),
    (3, 'John', 'Weru', 'Kenya', 'Nairobi', 'Africa', 'Advanced Python'),
    (4, 'Darik', 'Olal', 'Kenya', 'Nairobi', 'Africa', 'Advanced Python'),
    (5, 'Esther', 'Wambui', 'Kenya', 'Nairobi', 'Africa', 'Machine Learning'),
    (6, 'George', 'Ndede', 'USA', 'Dallas', 'N. America', 'Artificial Intelligence')
             ]

cur.executemany("INSERT INTO Students VALUES (?,?,?,?,?,?,?)", Student_List)
conn.commit
print("Records saved successfully")

Records saved successfully

In [14]:
#Save the courses in the Courses table
Coursework=[
    (1, "Advanced Python"),
    (2, "Machine Learning"),
    (3, "Introduction Data Science"),
    (4, "Artificial Intelligence"),
    (5, "Introduction Python"),
    (6, "Database Management"),
    (7, "Intro to Linux Administration"),
    (8, "Intro to AWS Foundations"),
    (9, "Python System Administration")

            ]

cur.executemany("INSERT INTO Courses VALUES (?,?)", Coursework)
conn.commit
print("Records saved successfully")

Records saved successfully

In [15]:
#join the tables Students and Courses
sqlstr="SELECT * FROM Students INNER JOIN Courses ON Students.Course= Courses.Coursename"
cur.execute (sqlstr)
for row in cur:
    print (row)

(1, 'Nicholas', 'Okello', 'Kenya', 'Nairobi', 'Africa', 'Advanced Python', 1, 'Advanced Python')
(2, 'Tim', 'Kabugi', 'Kenya', 'Nairobi', 'Africa', 'Advanced Python', 1, 'Advanced Python')
(3, 'John', 'Weru', 'Kenya', 'Nairobi', 'Africa', 'Advanced Python', 1, 'Advanced Python')
(4, 'Darik', 'Olal', 'Kenya', 'Nairobi', 'Africa', 'Advanced Python', 1, 'Advanced Python')
(5, 'Esther', 'Wambui', 'Kenya', 'Nairobi', 'Africa', 'Machine Learning', 2, 'Machine Learning')
(6, 'George', 'Ndede', 'USA', 'Dallas', 'N. America', 'Artificial Intelligence', 4, 'Artificial Intelligence')

In [16]:
#Read and display the result of the merged tables
cur.execute ("SELECT Students.ID, Students.Fname, Students.Lname, Students.Country, Students.City, Students.Continent, Students.Course, Courses.ID AS CourseID FROM Students INNER JOIN Courses ON Students.Course= Courses.Coursename")
formatted_result = [f"{ID:<5}{Fname:<12}{Lname:<10}{Country:<8}{City:<10}{Continent:<13}{Course:<27}{CourseID:<3}" for ID, Fname, Lname, Country, City, Continent, Course, CourseID in cur.fetchall()]
ID, Fname, Lname, Country, City, Continent, Course, CourseID = "ID", "Fname", "Lname", "Country", "City", "Continent", "Course", "CourseID"
print('\n'.join([f"{ID:<5}{Fname:<12}{Lname:<10}{Country:<8}{City:<10}{Continent:<13}{Course:<27}{CourseID:<3}"] + formatted_result))

ID   Fname       Lname     Country City      Continent    Course                     CourseID
1    Nicholas    Okello    Kenya   Nairobi   Africa       Advanced Python            1
2    Tim         Kabugi    Kenya   Nairobi   Africa       Advanced Python            1
3    John        Weru      Kenya   Nairobi   Africa       Advanced Python            1
4    Darik       Olal      Kenya   Nairobi   Africa       Advanced Python            1
5    Esther      Wambui    Kenya   Nairobi   Africa       Machine Learning           2
6    George      Ndede     USA     Dallas    N. America   Artificial Intelligence    4

In [17]:
#Add more courses to the Courses table
cur.execute("INSERT INTO Courses VALUES(10,'Introduction to Statistics')")
conn.commit
print("Record saved successfully")

Record saved successfully

In [18]:
#Update the Courses table
cur.execute("UPDATE Courses SET Coursename='AWS Foundations' WHERE ID=8")
conn.commit
print("Record updated successfully")

Record updated successfully

In [19]:
#Delete a record from table Students
cur.execute ("DELETE FROM Students WHERE ID=6")
conn.commit
print("Record deleted successfully")

Record deleted successfully

In [20]:
conn.close()